<html lang="es">
	<head>
		<title>CSS</title>
		<link rel="stylesheet" type="text/css" href="CSS.css" / >
		<meta charset="utf-8">
	</head>

	<body>

		<div class="lin">
		    <li><a class="act" href="index.html">Inicio</a></li>
			<li><a href="curric.html">Curr&iacute;culum</a></li>
			<li><a href="git.html">Git</a></li>
      		<li><a href="HTML.html">HTML</a></li>
			<li><a href="CSS.html">CSS</a></li>
    	</div>
		
		<ul>
			<div class="lena">
				<li><a class="active" href="#css">&iquest;Qu&eacute; es CSS?</a></li>
				<li><a href="#historia">Historia</a></li>
				<li><a href="#sintaxis">Sintaxis CSS</a></li>
				<li><a href="#" class="boton">Volver al inicio</a></li>
			</div>
		</ul>
		
		<div class="cajita3">
			<h2 id="css">&iquest;Qu&eacute; es CSS?</h2>
				<div class="texi">
					<p>
					CSS significa (Cascading Style Sheets) y es un lenguaje de programaci&oacute;n utilizado para definir
					la presentaci&oacute;n y el estilo visual de una p&aacute;gina web.
					<br>
					CSS se utiliza para separar el contenido de una p&aacute;gina web de su dise&ntilde;o y presentaci&oacute;n. Permite
					definir c&oacute;mo se deben visualizar los elementos HTML de una p&aacute;gina, incluyendo la fuente, el color,
					el tama&ntilde;o, la disposici&oacute;n y el posicionamiento.
					<br>
					En lugar de aplicar los estilos directamente en los elementos HTML de una p&aacute;gina, se definen en un 
					archivo separado de CSS que se vincula a la p&aacute;gina HTML. De esta manera, los desarrolladores pueden 
					actualizar el estilo visual de una p&aacute;gina web de manera f&aacute;cil y eficiente sin tener que cambiar
					el c&oacute;digo HTML subyacente.
					<br><br>
					
					</p>
				</div>
			<h2 id="historia">Historia</h2>
				<div class="texi">
					<p>
					CSS (Cascading Style Sheets) es un lenguaje de dise&ntilde;o utilizado para dar estilo y presentaci&oacute;n a 
					documentos HTML y XML. Fue desarrollado por el World Wide Web Consortium (W3C) en colaboraci&oacute;n con
					organizaciones y empresas de tecnolog&iacute;a de la informaci&oacute;n.
					<br><br>
					La historia de CSS se remonta a los primeros d&iacute;as de la web. En los primeros a&ntilde;os de la web, los dise&ntilde;adores
					web utilizaban HTML para crear p&aacute;ginas web y darles estilo. HTML inclu&iacute;a algunas etiquetas de estilo, como
					&lt;font&lt; y &lt;center&lt;, que permit&iacute;an dar formato y centrar el contenido de la p&aacute;gina. Sin embargo,
					estas etiquetas eran limitadas y no permit&iacute;an una gran flexibilidad en la presentaci&oacute;n de la p&aacute;gina.
					<br><br>
					En 1994, el W3C comenz&oacute; a desarrollar CSS como una forma de separar la presentaci&oacute;n de los documentos HTML.
					El objetivo era permitir a los dise&ntilde;adores web controlar la apariencia de una p&aacute;gina web sin tener que 
					preocuparse por la estructura del documento HTML. CSS permit&iacute;a que los dise&ntilde;adores web crearan estilos
					separados que se aplicaban a los elementos HTML en la p&aacute;gina web.
					<br><br>
					El primer borrador de CSS se public&oacute; en octubre de 1994, y en diciembre de ese a&ntilde;o se public&oacute; la versi&oacute;n
					1.0 de CSS. Esta primera versi&oacute;n de CSS era limitada y solo permit&iacute;a dar estilo a algunos elementos b&aacute;sicos
					de HTML, como texto, im&aacute;genes y tablas. Sin embargo, estableci&oacute; los fundamentos del lenguaje y sent&oacute; las
					bases para versiones posteriores de CSS.
					<br><br>
					En los a&ntilde;os siguientes, se publicaron varias versiones de CSS, cada una con nuevas caracter&iacute;sticas y capacidades.
					CSS2 se public&oacute; en mayo de 1998 y agreg&oacute; nuevas caracter&iacute;sticas como estilos de posicionamiento y flotaci&oacute;n, as&iacute;
					como soporte para medios impresos y de pantalla. CSS3 se ha desarrollado en varias etapas y ha agregado a&uacute;n m&aacute;s
					caracter&iacute;sticas, como animaciones y transformaciones.
					<br><br>
					En la actualidad, CSS es una parte esencial del dise&ntilde;o web y se utiliza en conjunto con HTML y JavaScript para crear
					p&aacute;ginas web modernas y atractivas. CSS ha evolucionado mucho desde sus primeros d&iacute;as, pero su objetivo sigue siendo 
					el mismo: permitir a los dise&ntilde;adores web controlar la apariencia de una p&aacute;gina web y separar la presentaci&oacute;n del contenido.
					</p>
				</div>
			<h2 id="sintaxis">Sintaxis CSS</h2>
				<div class="texi">
					<p>
					La sintaxis de CSS se utiliza para dar estilo a los documentos HTML y XML. A continuaci&oacute;n se presenta una descripci&oacute;n general
					de los diferentes componentes de la sintaxis CSS:
					<br><br>
					- Selectores: son patrones que se utilizan para seleccionar los elementos HTML que se desean estilizar. Se pueden seleccionar 
					elementos espec&iacute;ficos, como etiquetas HTML, clases o IDs.
					<br>
					- Propiedades: son los estilos que se aplican a los elementos seleccionados. Las propiedades pueden ser, por ejemplo, 
					color, tama&ntilde;o de fuente, m&aacute;rgenes, relleno, bordes, etc.
					<br>
					- Valores: son los valores que se asignan a las propiedades. Por ejemplo, el valor para la propiedad de color puede ser rojo, azul, negro, etc.
					<br>
					- Declaraciones: son la combinaci&oacute;n de propiedades y valores. Cada declaraci&oacute;n se separa con un punto y coma.
					<br>
					- Reglas: son combinaciones de selectores y declaraciones. Cada regla se separa con una llave de apertura y una llave de cierre. 
					Las reglas pueden aplicarse a un solo elemento o a un conjunto de elementos.
					<br>
					- Comentarios: se utilizan para a&ntilde;adir notas al c&oacute;digo CSS para explicar qu&eacute; hace cada parte del c&oacute;digo. Los comentarios se escriben entre /&ast; y &ast;/.
					</p>
				</div>
		</div>
			
		</body>
</html>
