<html lang="es">
	<head>
		<title>Git</title>
		<link rel="stylesheet" type="text/css" href="git.css" / >
		<meta charset="utf-8">
	</head>

	<body>

		<div class="lin">
		    <li><a class="act" href="index.html">Inicio</a></li>
			<li><a href="curric.html">Curr&iacute;culum</a></li>
			<li><a href="git.html">Git</a></li>
      		<li><a href="HTML.html">HTML</a></li>
			<li><a href="CSS.html">CSS</a></li>
    	</div>
		
		<ul>
			<div class="lena">
				<li><a class="active" href="#&iquest;Qu&eacute; es Git?">&iquest;Qu&eacute; es Git?</a></li>
				<li><a href="#Historia">Historia</a></li>
				<li><a href="#Instalaci&oacute;n/configuraci&oacute;n">Instalaci&oacute;n/configuraci&oacute;n</a></li>
				<li><a href="#Uso_b&aacute;sico">Uso b&aacute;sico</a></li>
				<li><a href="#Uso_avanzado">Uso avanzado</a></li>
				<li><a href="#Buenas_pr&aacute;cticas">Buenas pr&aacute;cticas</a></li>
				<li><a href="#Aprender_Git">Aprender Git</a></li>
				<li><a href="#" class="boton">Volver al inicio</a></li>
			</div>
		</ul>

		<div class="cajita3">
			<h2 id="&iquest;Qu&eacute; es Git?">&iquest;Qu&eacute; es Git?</h2>
				
				<div class="texi">
					<p>
					<div class="logit"><img src="imagenes/git.png" alt="Git" style="width:170px;height:110px;"></div>
					Git es una herramienta esencial para el control de versiones de software y ha sido ampliamente adoptada por la 
					comunidad de desarrolladores en todo el mundo. Esta investigaci&oacute;n tiene como objetivo proporcionar una visi&oacute;n 
					general de Git, incluyendo su historia, conceptos b&aacute;sicos, uso avanzado, y las mejores pr&aacute;cticas para trabajar
					con Git. A lo largo del documento, se explorar&aacute;ndiferentes aspectos de Git para brindar una comprensi&oacute;n completa
					de esta herramienta y su importancia en el desarrollo de software.
					</p>
				</div>
			
			<h2 id="Historia">Historia</h2>
				<div class="texi">
					<p>
					CVS (Concurrent Versions System) y SVN (Subversion) son dos de las herramientas de control de versiones m&aacute;s populares
					que surgieron en la d&eacute;cada de 1990 y principios de la d&eacute;cada de 2000. Ambas herramientas permit&iacute;an a los desarrolladores
					trabajar en proyectos de manera colaborativa y rastrear los cambios en el c&oacute;digo fuente. Sin embargo, estas herramientas
					ten&iacute;an limitaciones, como la dificultad para trabajar con ramas y la necesidad de una conexi&oacute;n constante a un servidor central.
					</p>
					<br>
					
					<p>
					<div class="logit"><img src="imagenes/linus.jpeg" alt="LinusT" style="width:130px;height:160px;"></div>
					Por esa raz&oacute;n Linus Torvalds, el creador del kernel de Linux, cre&oacute; Git en 2005 como respuesta a las limitaciones de las herramientas
					de control de versiones existentes. Torvalds quer&iacute;a una herramienta de control de versiones distribuida que permitiera 
					a los desarrolladores trabajar de manera efectiva en proyectos de gran escala y colaborar en diferentes ubicaciones sin
					necesidad de una conexi&oacute;n constante a un servidor central. Git permite trabajar con ramas y es m&aacute;s r&aacute;pido que otras
					herramientas de control de versiones.
					</p>
					<br>
					
					<p>
					El control de versiones es un proceso esencial en el desarrollo de software que permite a los desarrolladores rastrear
					los cambios en el c&oacute;digo fuente, colaborar en proyectos y revertir a versiones anteriores si es necesario. Antes de la
					llegada de las herramientas de control de versiones, los desarrolladores ten&iacute;an que crear copias de respaldo de sus
					archivos manualmente, lo que llevaba mucho tiempo y era propenso a errores.
					</p>
					<br>
					
					<p>
					Desde su creaci&oacute;n en 2005, Git ha evolucionado continuamente con la ayuda de la comunidad de desarrolladores que contribuyen
					al c&oacute;digo y proponen mejoras. Las empresas tambi&eacute;n han adoptado Git como su herramienta principal de control de versiones,
					incluyendo <a href="#GitHub">GitHub</a> y <a href="#GitLab">GitLab</a>, que ofrecen servicios en l&iacute;nea para alojar y gestionar 
					repositorios de Git. Git se ha convertido en una herramienta esencial para los desarrolladores de software y ha permitido una 
					colaboraci&oacute;n m&aacute;s efectiva y eficiente en proyectos a gran escala.
					</p>
				</div>
			<h2 id="Instalaci&oacute;n/configuraci&oacute;n">Instalaci&oacute;n y configuraci&oacute;n</h2>
				<div class="texi">
					<h4>Descarga de Git desde el sitio web oficial:</h4>
						<p>
						Para instalar Git, lo primero que debemos hacer es descargarlo desde el sitio web oficial. Git es compatible con varios
						sistemas operativos, incluyendo Windows, macOS y Linux. En el sitio web oficial de Git, podemos encontrar las instrucciones
						detalladas para descargar la versi&oacute;n correspondiente a nuestro sistema operativo.
						</p>
						<br>
						<a href="https://git-scm.com/downloads"><div class="inter">DESCARGAR GIT AQUI</div></a>
					<h4>Instalaci&oacute;n de Git en el sistema operativo correspondiente:</h4>
						<p>
						Una vez que se ha descargado el archivo de instalaci&oacute;n de Git, debemos seguir las instrucciones de instalaci&oacute;n para completar
						el proceso. En la mayor&iacute;a de los sistemas operativos, la instalaci&oacute;n de Git es bastante sencilla y se puede realizar con unos
						pocos clics.
						</p>
					<h4>Configuraci&oacute;n de Git con el nombre de usuario y la direcci&oacute;n de correo electr&oacute;nico del usuario:</h4>
						<p>
						Despu&eacute;s de instalar Git, lo siguiente es configurar nuestra informaci&oacute;n de usuario. Esto se hace para que cuando realicemos 
						cambios en nuestro repositorio, Git pueda identificar qui&eacute;n realiz&oacute; el cambio. Para configurar nuestro nombre de usuario y 
						direcci&oacute;n de correo electr&oacute;nico, podemos usar el comando "git config", seguido del nombre de usuario y la direcci&oacute;n de correo electr&oacute;nico.
						<br><br>
						Por ejemplo, para configurar el nombre de usuario "Saulzu" y la direcci&oacute;n de correo electr&oacute;nico "saulzu@example.com", 
						podemos ejecutar los siguientes comandos en la terminal:
						<br><br>
						git config --global user.name "Saulzu"<br>
						git config --global user.email saulzu@example.com
						</p>
					<h4>Configuraci&oacute;n de opciones avanzadas, como la configuraci&oacute;n de SSH y la gesti&oacute;n de credenciales:</h4>
						<p>
						Adem&aacute;s de la configuraci&oacute;n b&aacute;sica de Git, tambi&eacute;n podemos configurar opciones avanzadas, como la configuraci&oacute;n de SSH y la 
						gesti&oacute;n de credenciales. La configuraci&oacute;n de SSH permite una conexi&oacute;n m&aacute;s segura y eficiente entre el repositorio remoto y
						nuestro equipo local. La gesti&oacute;n de credenciales nos permite almacenar nuestras credenciales de autenticaci&oacute;n, como nuestro 
						nombre de usuario y contrase&ntilde;a, para que no tengamos que ingresarlas cada vez que interactuamos con el repositorio.
						</p>
				</div>
			<h2 id="Uso_b&aacute;sico">Uso b&aacute;sico</h2>
				<div class="texi">
					<h4>Creaci&oacute;n de un nuevo repositorio:</h4>
						<p>
						Para crear un nuevo repositorio en Git, podemos utilizar el comando "git init". Esto crear&aacute; una nueva carpeta
						de Git en el directorio actual y configurar&aacute; el repositorio de Git en esa carpeta. Una vez que se ha creado el 
						repositorio, podemos comenzar a agregar archivos y realizar cambios en ellos.
						</p>
					<h4>Agregar archivos al repositorio:</h4>
						<p>
						Para agregar archivos al repositorio de Git, podemos utilizar el comando "git add". Este comando permite agregar archivos 
						individuales o todos los archivos de un directorio espec&iacute;fico. Los archivos agregados se preparan para ser confirmados en el siguiente paso.
						</p>
					<h4>Realizaci&oacute;n de cambios en los archivos:</h4>
						<p>
						Una vez que hemos agregado archivos al repositorio, podemos realizar cambios en ellos. Estos cambios pueden incluir la 
						adici&oacute;n, eliminaci&oacute;n o modificaci&oacute;n de l&iacute;neas de c&oacute;digo en los archivos. Despu&eacute;s de realizar cambios, debemos agregar 
						los archivos modificados al &aacute;rea de preparaci&oacute;n utilizando el comando "git add".
						</p>
					<h4>Hacer commits y agregar mensajes significativos:</h4>
						<p>
						El siguiente paso es hacer un commit de los cambios realizados en los archivos. Un commit es una instant&aacute;nea del estado
						actual del repositorio en un momento determinado. Para hacer un commit, podemos utilizar el comando "git commit", seguido
						de un mensaje significativo que describa los cambios realizados. Es importante agregar mensajes significativos para que
						otros desarrolladores puedan entender f&aacute;cilmente los cambios realizados.
						<br><br>
						Por ejemplo, para hacer un commit con un mensaje significativo que describa los cambios realizados en los archivos, 
						podemos ejecutar el siguiente comando en la terminal:
						<br><br>
						git commit -m "Agregado nuevo archivo y modificado archivo existente"
						</p>
				</div>
			<h2 id="Uso_avanzado">Uso avanzado</h2>
				<div class="texi">
					<h4>Fusionar ramas y resolver conflictos:</h4>
						<p>
						En Git, podemos trabajar con diferentes ramas para organizar nuestro flujo de trabajo. La fusi&oacute;n de ramas nos permite
						combinar los cambios realizados en una rama con otra. Para fusionar ramas en Git, podemos utilizar el comando "git merge".
						En ocasiones, puede haber conflictos entre los cambios realizados en diferentes ramas, lo que puede impedir que la fusi&oacute;n
						se realice correctamente. Para resolver conflictos, debemos examinar los archivos que presentan conflictos y decidir qu&eacute;
						cambios deben conservarse. Luego, podemos utilizar el comando "git add" para agregar los cambios al &aacute;rea de preparaci&oacute;n
						y luego realizar un commit para finalizar la fusi&oacute;n.
						</p>
						<p>
						En Git, podemos trabajar con repositorios remotos para colaborar con otros desarrolladores en un proyecto. Para trabajar
						con un repositorio remoto, primero debemos agregarlo como un origen utilizando el comando "git remote add". Luego, 
						podemos utilizar comandos como "git pull" y "git push" para sincronizar nuestro repositorio local con el repositorio
						remoto. Tambi&eacute;n es posible clonar un repositorio remoto utilizando el comando "git clone".
						</p>
						<p>
						En Git, es posible revertir commits y deshacer cambios realizados en el repositorio. Para revertir un commit, podemos 
						utilizar el comando "git revert" seguido del identificador del commit que deseamos revertir. Este comando crear&aacute; un nuevo
						commit que deshace los cambios realizados en el commit anterior. Si deseamos deshacer cambios sin crear un nuevo commit, 
						podemos utilizar el comando "git reset". Sin embargo, debemos tener cuidado al utilizar este comando, ya que puede eliminar 
						permanentemente los cambios realizados. Tambi&eacute;n podemos utilizar comandos como "git stash" para guardar temporalmente cambios
						en una pila y luego restaurarlos m&aacute;s tarde.
						</p>
				</div>
			<h2 id="Buenas_pr&aacute;cticas">Buenas pr&aacute;cticas</h2>
				<div class="texi">
					<h4>Utilizar ramas para el desarrollo:</h4>
						<p>
						Es una buena pr&aacute;ctica utilizar ramas para el desarrollo de nuevas caracter&iacute;sticas o correcci&oacute;n de errores en nuestro proyecto.
						Esto nos permite separar los cambios en diferentes ramas y mantener el historial de cambios m&aacute;s organizado. Tambi&eacute;n nos permite
						trabajar en diferentes caracter&iacute;sticas de forma simult&aacute;nea sin interferir en el trabajo de otros desarrolladores.
						</p>
					<h4>Escribir mensajes de commit significativos:</h4>
						<p>
						Al hacer commits en nuestro proyecto, es importante escribir mensajes significativos que expliquen los cambios realizados. Los
						mensajes de commit deben ser descriptivos y explicar de forma clara y concisa los cambios realizados. Esto hace que sea m&aacute;s f&aacute;cil
						para otros desarrolladores entender lo que se ha modificado en el proyecto y nos ayuda a mantener un historial de cambios m&aacute;s comprensible.
						</p>
					<h4>Realizar peque&ntilde;os se compromete:</h4>
						<p>
						Es una buena pr&aacute;ctica realizar peque&ntilde;os commits con cambios espec&iacute;ficos en lugar de hacer un commit con muchos cambios diferentes.
						Los peque&ntilde;os commits facilitan la revisi&oacute;n de cambios y la resoluci&oacute;n de conflictos en el proyecto. Adem&aacute;s, nos permiten deshacer
						cambios espec&iacute;ficos en caso de errores.
						</p>
					<h4>Realizar pruebas y revisi&oacute;n de c&oacute;digo:</h4>
						<p>
						Antes de hacer un commit, es importante realizar pruebas y revisi&oacute;n de c&oacute;digo para garantizar que los cambios realizados funcionan
						correctamente y no introducen errores en el proyecto. La revisi&oacute;n de c&oacute;digo por otros desarrolladores puede identificar posibles
						errores o mejoras en el c&oacute;digo.
						</p>
					<h4>Mantener el repositorio limpio:</h4>
						<p>
						Es importante mantener el repositorio limpio eliminando ramas y commits innecesarios. Debemos eliminar ramas que ya no se utilizan
						y fusionar ramas que han completado su trabajo. Tambi&eacute;n debemos eliminar commits innecesarios, como aquellos que contienen cambios
						temporales o de prueba.
						</p>
					<h4>Documentar el proyecto:</h4>
						<p>
						Es una buena pr&aacute;ctica documentar nuestro proyecto para que otros desarrolladores puedan entender su funcionamiento. Esto incluye
						documentar el c&oacute;digo, el proceso de instalaci&oacute;n y configuraci&oacute;n, as&iacute; como cualquier otra informaci&oacute;n relevante del proyecto. La 
						documentaci&oacute;n tambi&eacute;n puede ayudar a los desarrolladores nuevos a contribuir al proyecto.
						</p>
				</div>
			<h2 id="Aprender_Git">Aprender Git</h2>
				<div class="texi">
					<p>Para aprender mas de Git </p>
						<a href="https://www.atlassian.com/es/git/tutorials"><div class="inter">Click AQUI</div></a>
					<p>Para aprender mas de Git Branching</p>
						<a href="https://learngitbranching.js.org/?locale=es_AR"><div class="inter">Click AQUI</div></a>
				</div>
			<h3 id="GitHub"><div class="keywords">GitHub</div></h3>
				<p>
				<div class="texi">
					<div class="logit"><img src="imagenes/github.png" alt="GitHub" style="width:130px;height:140px;"></div>
					GitHub es una plataforma de desarrollo colaborativo de software que permite a los usuarios alojar, revisar y colaborar en
					proyectos de software de manera remota. GitHub se basa en el sistema de control de versiones Git y proporciona herramientas y
					caracter&iacute;sticas que permiten a los desarrolladores trabajar juntos en proyectos de software de forma eficiente.
					<br>GitHub es utilizado por desarrolladores individuales, equipos de desarrollo y empresas para alojar y colaborar en proyectos
					de software de c&oacute;digo abierto y privado. La plataforma ofrece caracter&iacute;sticas como control de versiones, seguimiento de problemas,
					administraci&oacute;n de proyectos, wikis y la capacidad de crear ramas y fusionar cambios de forma segura.Adem&aacute;s, GitHub es un lugar para
					que los desarrolladores compartan su trabajo y aprendan de otros proyectos de c&oacute;digo abierto. La plataforma ofrece un lugar para
					que los desarrolladores y las comunidades de c&oacute;digo abierto publiquen y revisen proyectos, colaboren en problemas y discutan ideas
					y mejores pr&aacute;cticas.
				</div>
				</p>
			<h3 id="GitLab"><div class="keywords">GitLab</div></h3>
				<div class="texi">
					<p>
					<div class="logit"><img src="imagenes/gitlab.png" alt="GitLab" style="width:100px;height:120px;"></div>
					GitLab es una plataforma de gesti&oacute;n de repositorios de software, basada en Git, que proporciona herramientas y caracter&iacute;sticas
					para la gesti&oacute;n completa del ciclo de vida del desarrollo de software, incluyendo la gesti&oacute;n de proyectos, el seguimiento de
					problemas, la integraci&oacute;n continua, las pruebas automatizadas y la revisi&oacute;n de solicitudes de extracci&oacute;n. GitLab tambi&eacute;n ofrece
					opciones de implementaci&oacute;n flexibles, desde la autohospedaje hasta la nube p&uacute;blica y privada. En comparaci&oacute;n con GitHub, GitLab
					se enfoca en la gesti&oacute;n completa del ciclo de vida del desarrollo de software, mientras que GitHub se enfoca en el alojamiento
					y la colaboraci&oacute;n de proyectos de software.
					</p>
				</div>	
		</div>	
		
		</body>
</html>
