<html lang="es">
	<head>
		<title>HTML</title>
		<link rel="stylesheet" type="text/css" href="html.css" / >
		<meta charset="utf-8">
	</head>

	<body>
		<div class="lin">
		    <li><a class="act" href="index.html">Inicio</a></li>
			<li><a href="curric.html">Curr&iacute;culum</a></li>
			<li><a href="git.html">Git</a></li>
      		<li><a href="HTML.html">HTML</a></li>
			<li><a href="CSS.html">CSS</a></li>
    	</div>
		
		<ul>
			<div class="lena">
				<li><a class="active" href="#html">&iquest;Qu&eacute; es HTML?</a></li>
				<li><a href="#historia">Historia</a></li>
				<li><a href="#estructura">Estructura b&aacute;sica de un documento HTML</a></li>
				<li><a href="#etiquetas">Etiquetas HTML</a></li>
				<li><a href="#css/html">CSS y HTML</a></li>
				<li><a href="#accesibilidad">HTML y accesibilidad</a></li>
				<li><a href="#herramientas">Herramientas para el desarrollo con HTML</a></li>
				<li><a href="#" class="boton">Volver al inicio</a></li>
			</div>
		</ul>
		
		<div class="cajita3">
			<h2 id="&iquest;Qu&eacute; es Git?">&iquest;Qu&eacute; es HTML?</h2>
				<div class="texi">
					<p>
					<div class="logit"><img src="imagenes/HTML.png" alt="Logo" style="width:130px;height:160px;"></div>
					HTML (HyperText Markup Language) es un lenguaje de marcado utilizado para crear
					y estructurar contenidos web. En otras palabras, es el lenguaje que se utiliza 
					para definir la estructura y el contenido de una p&aacute;gina web.
					<br><br>
					HTML se compone de elementos o etiquetas que se utilizan para identificar 
					diferentes tipos de contenido, como encabezados, p&aacute;rrafos, im&aacute;genes, listas,
					tablas, entre otros. Adem&aacute;s, HTML permite incorporar otros tipos de contenido
					como CSS (Cascading Style Sheets) para dar estilo y dise&ntilde;o a la p&aacute;gina, as&iacute; 
					como JavaScript para agregar interactividad y dinamismo.
					
					<h4>Importancia de HTML en el desarrollo web:</h4>
						<p>
						HTML es uno de los pilares fundamentales del desarrollo web. Cualquier 
						sitio web que se visualice en un navegador web se basa en HTML. Es el 
						lenguaje que permite al desarrollador estructurar el contenido y definir 
						c&oacute;mo se muestra al usuario.<br><br>
						
						Sin HTML, las p&aacute;ginas web ser&iacute;an simplemente una lista de texto plano. 
						La capacidad de estructurar la informaci&oacute;n en secciones, p&aacute;rrafos, 
						encabezados, tablas, entre otros, hace que sea mucho m&aacute;s f&aacute;cil para 
						el usuario navegar y entender la informaci&oacute;n.<br><br>
						
						Adem&aacute;s, HTML es un lenguaje que se ha estandarizado a lo largo de los
						a&ntilde;os, lo que significa que los desarrolladores web pueden crear sitios
						web que sean compatibles con m&uacute;ltiples navegadores web y dispositivos.
						Esto es especialmente importante en la era actual, donde los usuarios 
						acceden a la web desde una amplia variedad de dispositivos, desde 
						computadoras de escritorio hasta tel&eacute;fonos m&oacute;viles y tabletas.
					</p>
				</div>
			<h2 id="historia">Historia</h2>
				<div class="texi">
					<p>
					HTML fue desarrollado por el cient&iacute;fico de la computaci&oacute;n brit&aacute;nico Tim Berners-Lee
					en 1989 mientras trabajaba en el CERN (Organizaci&oacute;n Europea para la Investigaci&oacute;n Nuclear)
					en Suiza. Berners-Lee quer&iacute;a crear una forma de compartir informaci&oacute;n entre los
					cient&iacute;ficos que trabajaban en el CERN de manera m&aacute;s efectiva, por lo que cre&oacute; un
					lenguaje que permit&iacute;a la creaci&oacute;n de p&aacute;ginas web.
					<br><br>
					El primer navegador web, llamado WorldWideWeb, tambi&eacute;n fue creado por Berners-Lee
					y se lanz&oacute; en 1990. Este navegador permit&iacute;a la visualizaci&oacute;n de p&aacute;ginas web en la
					pantalla de una computadora.
					</p>
					<h4>Evoluci&oacute;n de HTML a lo largo de los a&ntilde;os:</h4>
						<p>
							A lo largo de los a&ntilde;os, HTML ha evolucionado para incluir nuevas etiquetas
							y caracter&iacute;sticas que permiten a los desarrolladores crear sitios web m&aacute;s 
							complejos y avanzados. Las diferentes versiones de HTML son:
							
							<div class="ord">
								- HTML 2.0: Lanzado en 1995, fue la primera versi&oacute;n que se estandariz&oacute;.
								<br><br>
								- HTML 3.2: Lanzado en 1997, incluy&oacute; nuevas etiquetas y caracter&iacute;sticas
								para permitir una mayor personalizaci&oacute;n de las p&aacute;ginas web.
								<br><br>
								- HTML 4.0: Lanzado en 1997, incluy&oacute; nuevas etiquetas y caracter&iacute;sticas
								para hacer que las p&aacute;ginas web fueran m&aacute;s interactivas y din&aacute;micas.
								<br><br>
								- XHTML 1.0: Lanzado en 2000, fue una versi&oacute;n de HTML que se reformul&oacute; 
								utilizando la sintaxis de XML para hacer que las p&aacute;ginas web fueran 
								m&aacute;s f&aacute;ciles de leer por las computadoras.
								<br><br>
								- HTML5: Lanzado en 2014, es la versi&oacute;n m&aacute;s reciente de HTML. Incluye 
								muchas nuevas etiquetas y caracter&iacute;sticas que permiten a los desarrolladores
								crear sitios web m&aacute;s avanzados, como la integraci&oacute;n de video y audio,
								gr&aacute;ficos vectoriales y aplicaciones web.
							</div>
						</p>
					<h4>HTML 4.0 vs HTML 5.0:</h4>
						<img src="imagenes/vs.jpg" alt="VS" style="width:250px;height:120px;">
						<p>
						HTML4 fue desarrollado por un grupo de trabajo del W3C (Consorcio World Wide Web)
						liderado por Dave Raggett, mientras que HTML5 fue desarrollado por un grupo de 
						trabajo del W3C liderado por Ian Hickson.
						<br><br>
						Es importante destacar que, aunque estas personas lideraron el desarrollo de HTML4
						y HTML5, ambos lenguajes de marcado fueron creados y desarrollados por grandes 
						equipos de expertos en la industria de la web y en el W3C, trabajando juntos para
						mejorar y evolucionar la tecnolog&iacute;a web.
						<br><br>
						Una de las principales diferencias entre HTML4 y HTML5 es que HTML5 se enfoca en la
						creaci&oacute;n de sitios web m&aacute;s din&aacute;micos y avanzados. HTML5 incluye nuevas etiquetas para
						integrar video y audio, gr&aacute;ficos vectoriales, aplicaciones web y contenido interactivo.
						Tambi&eacute;n es m&aacute;s compatible con dispositivos m&oacute;viles y tabletas.
						<br><br>
						Adem&aacute;s, HTML5 incluye caracter&iacute;sticas de accesibilidad mejoradas, lo que significa que
						los desarrolladores pueden crear sitios web que sean m&aacute;s accesibles para personas con
						discapacidades. Tambi&eacute;n es m&aacute;s f&aacute;cil de mantener y actualizar en comparaci&oacute;n con 
						versiones anteriores de HTML.
						</p>
				</div>
			<h2 id="estructura">Estructura b&aacute;sica de un documento HTML</h2>
				<div class="texi">
					<h4>Elementos HTML b&aacute;sicos:</h4>
						<p>
							<div class="ord">
								- Etiquetas HTML: Las etiquetas HTML son los bloques de construcci&oacute;n fundamentales de cualquier
								documento HTML. Hay muchas etiquetas diferentes disponibles, y cada una tiene un prop&oacute;sito espec&iacute;fico.
								Por ejemplo, la etiqueta se utiliza para crear p&aacute;rrafos de texto, mientras que la etiqueta se utiliza
								para insertar im&aacute;genes en una p&aacute;gina web.
								<br><br>
								- Encabezado HTML: El encabezado HTML es una secci&oacute;n del documento HTML que contiene informaci&oacute;n sobre 
								el documento, como el t&iacute;tulo de la p&aacute;gina, los metadatos, los enlaces a hojas de estilo y otros datos
								importantes para la optimizaci&oacute;n de motores de b&uacute;squeda (SEO). El encabezado se define utilizando la
								etiqueta , y se sit&uacute;a antes del cuerpo de la p&aacute;gina web.
								<br><br>
								- Cuerpo HTML: El cuerpo HTML es la secci&oacute;n del documento HTML que contiene todo el contenido visible 
								de la p&aacute;gina web, como el texto
							</div>
						</p>
						
					<h4>Atributos HTML:</h4>
						<p>
							<div class="ord">
							- Id: Es un identificador &uacute;nico asignado a un elemento HTML espec&iacute;fico. Se utiliza para aplicar estilos CSS
							o para referirse al elemento desde otro lugar del documento HTML o desde un archivo JavaScript.
							<br><br>
							- Clase: Es un nombre asignado a un elemento HTML que se utiliza para aplicar estilos CSS a un grupo de 
							elementos con la misma clase.
							<br><br>
							- Atributos de estilo: Se utilizan para aplicar estilos CSS espec&iacute;ficos a un elemento HTML, como el tama&ntilde;o
							del texto, el color de fondo o el margen.
							<br><br>
							- Atributos de enlace: Se utilizan para vincular un documento HTML a otro, como enlaces a otros sitios web
							o a diferentes partes del mismo documento HTML.
							</div>
						</p>
					<p>
						Es importante tener en cuenta que estos elementos y atributos HTML son solo una peque&ntilde;a parte de la estructura b&aacute;sica
						de un documento HTML, ya que existen muchos otros elementos y atributos HTML que se pueden utilizar para crear p&aacute;ginas
						web complejas y din&aacute;micas. Sin embargo, conocer estos elementos y atributos b&aacute;sicos es esencial para comenzar a crear
						y desarrollar p&aacute;ginas web con HTML.
					</p>
				</div>
			<h2 id="etiquetas">Etiquetas HTML</h2>
				<div class="texi">
					<p>
					Las etiquetas HTML son los bloques de construcci&oacute;n fundamentales de cualquier documento HTML. Hay muchas etiquetas diferentes
					disponibles, y cada una tiene un prop&oacute;sito espec&iacute;fico. A continuaci&oacute;n, se presentan algunas de las etiquetas m&aacute;s comunes y su uso:
					<br><br>
					Etiquetas de texto: Las etiquetas de texto se utilizan para mostrar texto en una p&aacute;gina web. Algunas de las etiquetas de 
					texto m&aacute;s comunes son:
					<br><br>
					<div class="ord">
						&lt;p&gt;: Crea un p&aacute;rrafo de texto.<br>
						&lt;h1&gt; : Crea encabezados de diferentes niveles de importancia.<br>
						&lt;em&gt; y &lt;strong&gt;: Se utilizan para enfatizar o resaltar texto.<br>
						&lt;br&gt;: Inserta un salto de l&iacute;nea simple.<br>
						&lt;hr&gt; Crea una l&iacute;nea horizontal en la p&aacute;gina.
					</div>
					<br><br>
					
					Etiquetas de formato: Las etiquetas de formato se utilizan para aplicar estilos y formato al texto en una p&aacute;gina web.
					Algunas de las etiquetas de formato m&aacute;s comunes son:
					<br><br>
					<div class="ord">
						&lt;b&gt; y &lt;i&gt;: Se utilizan para aplicar negrita y cursiva al texto, respectivamente.<br>
						&lt;u&gt;: Se utiliza para subrayar texto.<br>
						&lt;sup&gt; y &lt;sub&gt;: Se utilizan para crear super&iacute;ndices y sub&iacute;ndices, respectivamente.
					</div>
					<br><br>
					
					Etiquetas de enlace: Las etiquetas de enlace se utilizan para crear enlaces a otras p&aacute;ginas web o a diferentes partes
					de la misma p&aacute;gina. Algunas de las etiquetas de enlace m&aacute;s comunes son:
					<br><br>
					<div class="ord">
						&lt;a&gt;: Se utiliza para crear un enlace a otra p&aacute;gina web o a una ubicaci&oacute;n espec&iacute;fica en la misma p&aacute;gina.<br>
						&lt;link&gt;: Se utiliza para vincular un documento HTML a una hoja de estilo externa.<br>
					</div>
					Etiquetas de imagen: Las etiquetas de imagen se utilizan para insertar im&aacute;genes en una p&aacute;gina web. Algunas de las
					etiquetas de imagen m&aacute;s comunes son:<br><br>
					<div class="ord">
						&lt;a&gt;: Se utiliza para insertar una imagen en una p&aacute;gina web.<br>
						&lt;figure&gt; y &lt;figcaption&gt;: Se utilizan para agrupar una imagen con su t&iacute;tulo o leyenda correspondiente.<br><br>
					</div>
					Etiquetas de tabla: Las etiquetas de tabla se utilizan para crear tablas en una p&aacute;gina web. 
					Algunas de las etiquetas de tabla m&aacute;s comunes son:<br><br>
					<div class="ord">
						&lt;table&gt;: Crea una tabla en la p&aacute;gina web.<br>
						&lt;tr&gt;: Crea una fila en la tabla.<br>
						&lt;td&gt;: Crea una celda en la tabla.
					</div>
					</p>
				</div>
			<h2 id="css/html">CSS y HTML</h2>
				<div class="texi">
					<p>
					CSS (Cascading Style Sheets) y HTML (Hypertext Markup Language) son dos tecnolog&iacute;as fundamentales para la creaci&oacute;n de p&aacute;ginas web.
					HTML se utiliza para definir la estructura y el contenido de la p&aacute;gina, mientras que CSS se utiliza para definir su presentaci&oacute;n 
					visual y estilo.
					<br><br>
					La importancia de CSS en la presentaci&oacute;n de p&aacute;ginas HTML radica en la capacidad que ofrece para separar la presentaci&oacute;n del contenido.
					Esto significa que se puede definir el estilo y la apariencia visual de una p&aacute;gina web en un archivo CSS separado, lo que facilita su 
					mantenimiento y modificaci&oacute;n. Adem&aacute;s, el uso de CSS permite una mayor flexibilidad en la presentaci&oacute;n visual de una p&aacute;gina web, lo que
					puede mejorar su usabilidad y accesibilidad.
					<div class="logit"><img src="imagenes/css.png" alt="Logo" style="width:130px;height:160px;"></div>
					<br><br>
					La integraci&oacute;n de CSS y HTML se realiza mediante la inclusi&oacute;n de una referencia al archivo CSS en el c&oacute;digo HTML. Esto se hace mediante
					la etiqueta <enlace>, que se coloca en el encabezado del documento HTML y especifica la ubicaci&oacute;n del archivo CSS. Una vez que se ha 
					establecido la conexi&oacute;n entre HTML y CSS, se pueden utilizar selectores CSS para aplicar estilos a elementos HTML espec&iacute;ficos.
					<br><br>
					La integraci&oacute;n de CSS y HTML tambi&eacute;n permite la creaci&oacute;n de dise&ntilde;os de p&aacute;gina m&aacute;s complejos y personalizados, lo que mejora la 
					experiencia de usuario y la apariencia visual de la p&aacute;gina. Por ejemplo, se pueden utilizar estilos CSS para crear dise&ntilde;os de p&aacute;gina
					responsivos que se adapten a diferentes tama&ntilde;os de pantalla, lo que es especialmente importante en la era de los dispositivos m&oacute;viles.
					<br><br>
					</p>
				</div>
			<h2 id="accesibilidad">HTML y accesibilidad</h2>
				<div class="texi">
					<p>
					La accesibilidad web se refiere a la capacidad de las personas con discapacidades para acceder y utilizar sitios web de manera efectiva.
					Es importante tener en cuenta la accesibilidad en el desarrollo de sitios web, ya que es un requisito legal y &eacute;tico, y tambi&eacute;n ayuda a
					llegar a una audiencia m&aacute;s amplia.
					<br><br>
					HTML es un elemento clave en la accesibilidad web, ya que proporciona la estructura b&aacute;sica de un sitio web. Al utilizar HTML de manera
					efectiva, se pueden crear sitios web m&aacute;s accesibles para personas con discapacidades. Algunas formas en que HTML puede mejorar la 
					accesibilidad web incluyen:
					<br><br>
					- Proporcionar una estructura clara y ordenada para el contenido del sitio web utilizando etiquetas sem&aacute;nticas como &lt;header&lt;,
					&lt;nav&lt;, &lt;main&lt;, &lt;article&lt;, &lt;section&lt;, &lt;aside&lt;, &lt;footer&lt; y &lt;h1&lt; - &lt;h6&lt;.
					<br>
					- Proporcionar alternativas de texto para elementos no textuales, como im&aacute;genes, utilizando el atributo "alt" en la etiqueta &lt;img&lt;.
					<br>
					- Proporcionar subt&iacute;tulos para elementos de audio y video utilizando la etiqueta &lt;track&lt; o el atributo "subtitle" en la
					etiqueta &lt;audio&lt; o &lt;video&lt;.
					<br>
					- Proporcionar descripciones de texto para elementos interactivos, como botones y formularios, utilizando la etiqueta &lt;label&lt;.
					<br>
					- Utilizar atributos como "tabindex" para controlar el orden en que se enfoca los elementos interactivos.
					<br>
					- Evitar el uso exclusivo de colores para transmitir informaci&oacute;n o diferenciar elementos.
					<br>
					- Proporcionar una navegaci&oacute;n clara y f&aacute;cil de usar utilizando elementos como men&uacute;s desplegables y enlaces de salto.
					</p>
				</div>
		</div>

		</body>
</html>
